#include <iostream>
#include <string>
#include <fstream>

using namespace std;

int main()
{
	// С использованием файловых и строковых потоков написать программу,
	// которая считывает текст из файла и выводит его на экран, меняя местами
	// каждые два соседних слова
	char c;
	cout << "Hello user" << endl;
	cin >> c;
	return 0;
}